aitrios/aitrios-edge-device-manager/src/porting_layer/src/common/firmware_manager/firmware_manager_esp32_fw.c
/*
 * SPDX-FileCopyrightText: 2024-2025 Sony Semiconductor Solutions Corporation
 *
 * SPDX-License-Identifier: Apache-2.0
 */

// This is the "Firmware Manager Porting Layer (Fw Mgr PL) ESP32 FW Block",  a
// part of Firmware Manager Porting Layer. This block handles operations
// specific to update, rollback, or factory reset firmware (FW) of ESP32-S3.
//
// This block receives (through `FwMgrEsp32FwWrite`) a binary that is created by
// combining
// - [A]: the firmware encrypted for ota_0 and
// - [B]: the same firmware as [A] but encrypted for ota_1.
// ([A] and [B] is different because an encryption result depends on the address
// of flash memory on which the binary is written.) The first half of the binary
// is [A], and the second half is [B].
// `total_write_size` which `FwMgrEsp32FwOpen` receives is the total size of [A]
// and [B].
// When the currently running firmware is stored in ota_0 partition of the flash
// memory, a new firmware should be written to ota_1. So, in that case, the
// first half of the binary (i.e., [A]) received through `FwMgrPlEsp32FwWrite`
// is discarded, and only the second half (i.e., [B]) is written to the flash
// memory. (And when the currently running firmware is in ota_1, the second half
// of the received binary is discard.)

// This block does NOT manage the state of Fw Mgr PL, as it is done by the Fw
// Mgr PL Common block (written in firmware_manager_porting_layer.c).
// The public functions in this block MUST NOT be executed at the same time by
// multiple threads/processes. (To make sure of it is the responsibility of the
// Fw Mgr PL Common block.)

// TODO: delete the macro ESF_FW_MGR_PL_USE_MBEDTLS_V2
// This config is enabled only for T3P.
// Currently, T3P uses mbedtls v2, while T5 uses v3. This is because Nuttx and
// EVP for T3P only support v2. In the near future, Nuttx and EVP for T3P will
// support v3, and then mbedtls v3 will be used for both T3 and T5. Until then,
// the Firmware Manager needs to switch between mbedtls v2 and v3 because the
// APIs for v2 and v3 are slightly different.

#include "firmware_manager_esp32_fw.h"

#include <stdlib.h>
#include <string.h>
#include <time.h>

#include "esp32_flash_operations.h"
#include "firmware_manager_esp32_fw_context.h"
#include "firmware_manager_esp32_fw_processor_specific.h"
#include "firmware_manager_esp32_fw_pstorage.h"
#include "firmware_manager_porting_layer_log.h"
#include "mbedtls/sha256.h"
#include "parameter_storage_manager.h"
#include "verify_handle.h"

#ifdef CONFIG_EXTERNAL_FIRMWARE_MANAGER_USE_MBEDTLS_V2
#define ESF_FW_MGR_HANDLE_MBEDTLS_ERROR(operation, error_handling) operation
#else
#define ESF_FW_MGR_HANDLE_MBEDTLS_ERROR(operation, error_handling) \
  do {                                                             \
    int r = operation;                                             \
    if (r != 0) error_handling;                                    \
  } while (0)
#endif

// Internal enumerated type and structures -------------------------------------

typedef struct TagEsp32FirmwareInfo {
  // Whether SHA256 hash is appended at the end of the firmware image.
  bool hash_appended;
  // The size of firmware (NOT including the appended hash)
  uint32_t firmware_size;
} Esp32FirmwareInfo;

// Global variables ------------------------------------------------------------

// Currently used context. Only one context can exist.
static FwMgrEsp32FwContext *s_active_context = NULL;

// Internal Functions ---------------------------------------------------------

/// @brief Read firmware and confirm that the header magic is correct and chip
/// id corresponds to the target AP.
/// @param partition: [in] Partition where the firmware is written.
/// @param header: [out] Infomation of the firmware (which is obtained by
/// reading the header). `firmware_size` will be set only when `hash_appended ==
/// true`.
/// @return kOk: success, otherwise: failed
static PlErrCode ReadAndVerifyFirmwareHeader(FwMgrPlOtaImgBootseq partition,
                                             Esp32FirmwareInfo *header) {
  struct {
    uint8_t magic;
    uint8_t segment_count;
    uint8_t padding_1[10];
    uint16_t chip_id;
    uint8_t padding_2[9];
    uint8_t hash_appended;
  } __attribute__((packed)) header_buf;

  if (header == NULL) {
    FW_MGR_PL_DLOG_ERROR("`header` is NULL.\n");
    FW_MGR_PL_ELOG_ERROR(kFwMgrPlElogErrorId0x60Fw);
    return kPlErrInvalidParam;
  }

  // Read the firmware header.
  PlErrCode ret = Esp32FlashOpReadPartitionData(
      partition, /* offset = */ 0, sizeof(header_buf), (uint8_t *)&header_buf);
  if (ret != kPlErrCodeOk) {
    FW_MGR_PL_DLOG_ERROR("Failed to read the firmware header.\n");
    FW_MGR_PL_ELOG_ERROR(kFwMgrPlElogErrorId0x61Fw);
    return ret;
  }
  FW_MGR_PL_DLOG_DEBUG("header magic: 0x%x\n", header_buf.magic);
  FW_MGR_PL_DLOG_DEBUG("header chip_id: 0x%x\n", header_buf.chip_id);
  FW_MGR_PL_DLOG_DEBUG("header hash_appended: 0x%x\n",
                       header_buf.hash_appended);
  FW_MGR_PL_DLOG_DEBUG("header segment_count: %u\n", header_buf.segment_count);

  const uint8_t kEsp32BootImgIdentifierMagic = 0xE9;
  // Verify the header magic.
  if (header_buf.magic != kEsp32BootImgIdentifierMagic) {
    FW_MGR_PL_DLOG_CRITICAL(
        "The magic in the firmware header must be 0x%x, but it is 0x%x\n",
        (uint32_t)kEsp32BootImgIdentifierMagic, header_buf.magic);
    FW_MGR_PL_ELOG_CRITICAL(kFwMgrPlElogCriticalId0x60FwInvalidMagic);
    return kPlErrInvalidValue;
  }

  // Verify chip id specified in the header.
  if (header_buf.chip_id != kEsp32ChipId) {
    FW_MGR_PL_DLOG_CRITICAL(
        "Chip ID in the firmware header must be 0x%x, but it is 0x%x\n",
        (uint32_t)kEsp32ChipId, header_buf.chip_id);
    FW_MGR_PL_ELOG_CRITICAL(kFwMgrPlElogCriticalId0x61FwInvalidChipId);
    return kPlErrInvalidValue;
  }

  const uint8_t kEsp32BootImgHashAppended = 0x01;
  header->hash_appended =
      (header_buf.hash_appended == kEsp32BootImgHashAppended);
  header->firmware_size = 0;

  // Calculate the firmware size by summing up the segment size of all segments.
  // (The segment size is written in the header of each segment.)
  // The firmware size will be used only when SHA256 hash is appended. So when
  // the hash is not appended, this calculation is skipped.
  if (header->hash_appended) {
    uint32_t offset = sizeof(header_buf);
    uint32_t segment_count = (uint32_t)header_buf.segment_count;

