aitrios/aitrios-edge-device-manager/src/porting_layer/src/common/firmware_manager/firmware_manager_esp32_fw.c
    struct {
      uint32_t padding;
      uint32_t segment_size;
    } segment_header_buf;

    for (uint32_t i = 0; i < segment_count; ++i) {
      ret = Esp32FlashOpReadPartitionData(partition, offset,
                                          sizeof(segment_header_buf),
                                          (uint8_t *)&segment_header_buf);
      if (ret != kPlErrCodeOk) {
        FW_MGR_PL_DLOG_ERROR(
            "Failed to read the segment header of firmware. Segment No: %u, "
            "partition: %u, ret: %u\n",
            i, partition, ret);
        FW_MGR_PL_ELOG_ERROR(kFwMgrPlElogErrorId0x62Fw);
        return kPlErrInternal;
      }
      offset += sizeof(segment_header_buf) + segment_header_buf.segment_size;
    }

    // 1 byte for checksum
    offset += 1;

    // Add size of padding to make firmware size a multiple of 16 is added.
    // This operation corresponds to the one in the function `process_checksum`
    // in esp_image_format.c of the 2nd bootloader. (padding_size == length in
    // the process_checksum)
    uint32_t last_four_bits = offset & 0x0000000f;
    uint32_t padding_size = 0;
    if (last_four_bits != 0) padding_size = 0x10 - last_four_bits;

    header->firmware_size = offset + padding_size;
    FW_MGR_PL_DLOG_DEBUG("Firmware size = 0x%x\n", header->firmware_size);
  }

  return kPlErrCodeOk;
}

/// @brief Verify the hash appended at the end of firmware matches the SHA256
/// hash of the firmware.
/// @param context [in]
/// @param partition [in] Partition where the firmware is written.
/// @param firmware_size [in] The size of firmware (NOT including the appended
/// hash). Must be a multiple of 16.
/// @return kOk: success, otherwise: failed
static PlErrCode VerifyFirmwareHash(FwMgrEsp32FwContext *context,
                                    FwMgrPlOtaImgBootseq partition,
                                    uint32_t firmware_size) {
  if (context == NULL) {
    FW_MGR_PL_DLOG_ERROR("context is NULL.\n");
    FW_MGR_PL_ELOG_ERROR(kFwMgrPlElogErrorId0x63Fw);
    return kPlErrInvalidParam;
  }

  if ((context->tmp_buffer == NULL) || (context->tmp_buffer_size <= 0)) {
    FW_MGR_PL_DLOG_ERROR("Invalid tmp buffer: address = %p, size = %d.\n",
                         context->tmp_buffer, context->tmp_buffer_size);
    FW_MGR_PL_ELOG_ERROR(kFwMgrPlElogErrorId0x64Fw);
    return kPlErrInvalidParam;
  }

  mbedtls_sha256_context sha256_ctx;

  const int32_t kSha256HashSize = 32;
  uint8_t calculated_hash[kSha256HashSize];
  uint8_t appended_hash[kSha256HashSize];

  // firmware_size must be a multiple of 16.
  if (firmware_size & 0x0000000f) {
    FW_MGR_PL_DLOG_ERROR(
        "`firmware_size` must be a multiple of 16, but it is 0x%x.\n",
        firmware_size);
    FW_MGR_PL_ELOG_ERROR(kFwMgrPlElogErrorId0x87Fw);
    return kPlErrInvalidParam;
  }

  PlErrCode ret = kPlErrCodeError;

  mbedtls_sha256_init(&sha256_ctx);
  ESF_FW_MGR_HANDLE_MBEDTLS_ERROR(mbedtls_sha256_starts(&sha256_ctx, 0), {
    FW_MGR_PL_DLOG_ERROR("mbedtls_sha256_starts() failed.\n");
    FW_MGR_PL_ELOG_ERROR(kFwMgrPlElogErrorId0x65Fw);
    ret = kPlErrInternal;
    goto free_sha256_ctx_then_exit;
  });

  uint32_t offset = 0;
  while (firmware_size > 0) {
    uint32_t read_size = context->tmp_buffer_size;
    if (read_size > firmware_size) read_size = firmware_size;

    ret = Esp32FlashOpReadPartitionData(partition, offset, read_size,
                                        context->tmp_buffer);
    if (ret != kPlErrCodeOk) {
      FW_MGR_PL_DLOG_ERROR("Failed to read the firmware.\n");
      FW_MGR_PL_ELOG_ERROR(kFwMgrPlElogErrorId0x66Fw);
      FW_MGR_PL_DLOG_DEBUG("partition: %u, offset: 0x%x, read_size: 0x%x).\n",
                           partition, offset, read_size);
      goto free_sha256_ctx_then_exit;
    }

    ESF_FW_MGR_HANDLE_MBEDTLS_ERROR(
        mbedtls_sha256_update(&sha256_ctx, context->tmp_buffer, read_size), {
          FW_MGR_PL_DLOG_ERROR("mbedtls_sha256_update() failed.\n");
          FW_MGR_PL_ELOG_ERROR(kFwMgrPlElogErrorId0x67Fw);
          ret = kPlErrInternal;
          goto free_sha256_ctx_then_exit;
        });

    offset += read_size;
    firmware_size -= read_size;
  }

  ESF_FW_MGR_HANDLE_MBEDTLS_ERROR(
      mbedtls_sha256_finish(&sha256_ctx, calculated_hash), {
        FW_MGR_PL_DLOG_ERROR("mbedtls_sha256_finish() failed.\n");
        FW_MGR_PL_ELOG_ERROR(kFwMgrPlElogErrorId0x68Fw);
        ret = kPlErrInternal;
        goto free_sha256_ctx_then_exit;
      });

  ret = Esp32FlashOpReadPartitionData(partition, offset, kSha256HashSize,
                                      appended_hash);
  if (ret != kPlErrCodeOk) {
    FW_MGR_PL_DLOG_ERROR(
        "Failed to read the SHA256 hash appended to the firmware.\n");
    FW_MGR_PL_ELOG_ERROR(kFwMgrPlElogErrorId0x69Fw);
    goto free_sha256_ctx_then_exit;
  }

  int r = memcmp(calculated_hash, appended_hash, kSha256HashSize);
  if (r != 0) {
    FW_MGR_PL_DLOG_CRITICAL(
        "The calculated hash does not match the appended hash.\n");
    FW_MGR_PL_ELOG_CRITICAL(kFwMgrPlElogCriticalId0x62FwInvalidHash);

    ret = kPlErrInvalidValue;
    goto free_sha256_ctx_then_exit;
  }

free_sha256_ctx_then_exit:
  mbedtls_sha256_free(&sha256_ctx);

  return ret;
}

/// @brief Get target Partition
/// @param target_partition [out]
/// @return kOk: success, kError: failed
static PlErrCode GetTargetPartition(FwMgrPlOtaImgBootseq *target_partition) {
  if (target_partition == NULL) {
    FW_MGR_PL_DLOG_ERROR("target_partition is NULL.\n");
    FW_MGR_PL_ELOG_ERROR(kFwMgrPlElogErrorId0x6aFw);
    return kPlErrInvalidParam;
  }

  FwMgrPlOtaImgBootseq active_partition = OTA_IMG_BOOT_INVALID;

  PlErrCode ret = Esp32FlashOpGetActivePartition(&active_partition);
  if (ret != kPlErrCodeOk) {
    FW_MGR_PL_DLOG_ERROR("Esp32FlashOpGetActivePartition() failed.\n");
    FW_MGR_PL_ELOG_ERROR(kFwMgrPlElogErrorId0x6bFw);
    return ret;
  }

  switch (active_partition) {
    case OTA_IMG_BOOT_FACTORY:
    case OTA_IMG_BOOT_OTA_1:
      *target_partition = OTA_IMG_BOOT_OTA_0;
      break;

    case OTA_IMG_BOOT_OTA_0:
      *target_partition = OTA_IMG_BOOT_OTA_1;
      break;

    default:
      FW_MGR_PL_DLOG_CRITICAL("Invalid `active_partition`: %u.\n",
                              active_partition);
      FW_MGR_PL_ELOG_CRITICAL(kFwMgrPlElogCriticalId0x80Fw);
      return kPlErrInternal;
  }

