aitrios/aitrios-edge-device-manager/src/porting_layer/src/common/firmware_manager/firmware_manager_esp32_fw.c
  return kPlErrCodeOk;
}

/// @brief Verify that `total_write_size` is a multiple of 32 and in the range
/// of (0, partition size].
/// @param target_partition [in]
/// @param total_write_size [in]
/// @return kOk: Verification success; kInvalid Argument: Verification failed;
/// Internal: Internal Error
static PlErrCode VerifyTotalWriteSize(FwMgrPlOtaImgBootseq target_partition,
                                      uint32_t total_write_size) {
  uint32_t partition_size = 0;

  // Verify total_write_size is a multitude of 32.
  if (total_write_size & 0x0000001f) {
    FW_MGR_PL_DLOG_CRITICAL(
        "`total_write_size` must be a multiple of 32, but it is 0x%x.\n",
        total_write_size);
    FW_MGR_PL_ELOG_CRITICAL(kFwMgrPlElogCriticalId0x63FwInvalidSize);
    return kPlErrInvalidParam;
  }

  PlErrCode ret = Esp32FlashOpGetPartitionSize(target_partition,
                                               &partition_size);
  if (ret != kPlErrCodeOk) {
    FW_MGR_PL_DLOG_ERROR("Esp32FlashOpGetPartitionSize() failed.\n");
    FW_MGR_PL_ELOG_ERROR(kFwMgrPlElogErrorId0x6cFw);
    return ret;
  }

  // TODO: Decide whether we check the partition_size
  // is not TOO LARGE.
  FW_MGR_PL_DLOG_DEBUG("partition_size = 0x%x\n", partition_size);

  if ((total_write_size == 0) ||
      (total_write_size > partition_size * kEsp32FlashNumOtaPartitions)) {
    FW_MGR_PL_DLOG_CRITICAL(
        "Invalid `total_write_size`. It must be in the range of (0, 0x%x], "
        "but it is 0x%x.\n",
        partition_size * kEsp32FlashNumOtaPartitions, total_write_size);
    FW_MGR_PL_ELOG_CRITICAL(kFwMgrPlElogCriticalId0x81Fw);
    return kPlErrInvalidParam;
  }

  return kPlErrCodeOk;
}

/// @brief Free the context
/// @param context [in/out]
static void FreeContext(FwMgrEsp32FwContext *context) {
  free(context->tmp_buffer);
  free(context);
  s_active_context = NULL;
}

/// @brief
/// @param target_partition [in]
/// @param total_write_size [in]
/// @param context [out]
/// @return kOk: success, kError: failed
/// @note When this function successes, to free `context` is the caller's
/// responsibility.
static PlErrCode AllocateAndInitializeContext(
    FwMgrPlOtaImgBootseq target_partition, uint32_t total_write_size,
    FwMgrEsp32FwContext **context) {
  if (context == NULL) {
    FW_MGR_PL_DLOG_ERROR("`context` is NULL\n");
    FW_MGR_PL_ELOG_ERROR(kFwMgrPlElogErrorId0x6dFw);
    return kPlErrInvalidParam;
  }
  if (s_active_context != NULL) {
    FW_MGR_PL_DLOG_ERROR("There is an active context.\n");
    FW_MGR_PL_ELOG_ERROR(kFwMgrPlElogErrorId0x6eFw);
    return kPlErrInvalidState;
  }

  *context = (FwMgrEsp32FwContext *)malloc(sizeof(FwMgrEsp32FwContext));
  if (*context == NULL) {
    FW_MGR_PL_DLOG_CRITICAL("Failed to allocate memory for the context.\n");
    FW_MGR_PL_ELOG_CRITICAL(kFwMgrPlElogCriticalId0x64FwAllocContext);
    return kPlErrMemory;
  }

  PlErrCode ret = kPlErrCodeError;

  (*context)->tmp_buffer_size = 0x8000;  // 32 KB
  (*context)->tmp_buffer =
      (uint8_t *)malloc((*context)->tmp_buffer_size * sizeof(uint8_t));
  if ((*context)->tmp_buffer == NULL) {
    FW_MGR_PL_DLOG_CRITICAL(
        "Failed to allocate memory for the temporary buffer.\n");
    FW_MGR_PL_ELOG_CRITICAL(kFwMgrPlElogCriticalId0x65FwAllocTmpBuffer);
    ret = kPlErrMemory;
    goto err_exit;
  }

  // The context is mainly used in FwMgrEsp32FwWrite(). It receives a binary to
  // be written to the flash memory. The first half of the binary is encrypted
  // for ota_0 and the second half of it is encrypted for ota_1. When the target
  // partition is ota_0, the first half will be written to the flash memory and
  // the second half will be discarded. (When the target partition is ota_1, the
  // first half will be discarded and the second half will be written.)
  // `actual_binary_size` is the size of the binary which will be written to
  // flash memory (when FwMgrEsp32FwWrite() is called.) With
  // FwMgrEsp32FwWrite(), data within the range of `context->starting_offset <=
  // offset < context->ending_offset` will be written to the flash memory
  uint32_t ota_number;
  switch (target_partition) {
    case OTA_IMG_BOOT_OTA_0:
      ota_number = 0;
      break;

    case OTA_IMG_BOOT_OTA_1:
      ota_number = 1;
      break;

    default:
      FW_MGR_PL_DLOG_ERROR("Invalid `target_partition`: %u\n",
                           target_partition);
      FW_MGR_PL_ELOG_ERROR(kFwMgrPlElogErrorId0x6fFw);
      ret = kPlErrInternal;
      goto err_exit;
  }

  (*context)->flash_handle = NULL;

  uint32_t actual_binary_size = total_write_size / kEsp32FlashNumOtaPartitions;
  (*context)->starting_offset = ota_number * actual_binary_size;
  (*context)->ending_offset = (*context)->starting_offset + actual_binary_size;

  (*context)->max_write_size = total_write_size;

  s_active_context = *context;

  return kPlErrCodeOk;

err_exit:
  FreeContext(*context);
  *context = NULL;
  return ret;
}

static void GetCurrentTime(size_t size, char *date) {
  if (date == NULL) {
    FW_MGR_PL_DLOG_WARNING("date is NULL. Does nothing.\n");
    return;
  }

  struct timespec ts;
  struct tm tm_info;

  // Get current time
  clock_gettime(CLOCK_REALTIME, &ts);
  memset(&tm_info, 0, sizeof(tm_info));
  localtime_r(&ts.tv_sec, &tm_info);

  // Get timezone offset
  int offset = tm_info.tm_gmtoff;             // Get offset in seconds
  int offset_hours = offset / 3600;           // Convert to hours
  int offset_minutes = (offset % 3600) / 60;  // Convert to minutes

  // Calculate fractional seconds as an integer
  int fractional_seconds = ts.tv_nsec /
                           1000000;  // Convert nanoseconds to milliseconds

  // Create ISO 8601 format string
  // Common part for both UTC and local time
  snprintf(date, size, "%04d-%02d-%02dT%02d:%02d:%02d.%03d",
           (tm_info.tm_year + 1900) % 10000,  // Year offset from 1900
           (tm_info.tm_mon + 1) % 100,        // Month is 0-11, so +1
           tm_info.tm_mday % 100,             // Day
           tm_info.tm_hour % 100,             // Hour
           tm_info.tm_min % 100,              // Minute
           tm_info.tm_sec % 100,              // Seconds
           fractional_seconds % 1000);        // Milliseconds

  // Add timezone information
  if (offset == 0) {
    // For UTC, use 'Z'
    snprintf(date + strnlen(date, size), size - strnlen(date, size), "Z");
  } else {
    // For other time zones, include offset
    snprintf(date + strnlen(date, size), size - strnlen(date, size),
             "%c%02d:%02d",
             (offset >= 0) ? '+' : '-',  // Sign of timezone offset
             abs(offset_hours),          // Hours of timezone offset
             abs(offset_minutes));       // Minutes of timezone offset
  }

