aitrios/aitrios-edge-device-manager/src/porting_layer/src/common/firmware_manager/firmware_manager_esp32_fw.c
  date[size - 1] = '\0';
}

static int PartitionToHashDateIndex(FwMgrPlOtaImgBootseq target_partition) {
  int index;
  if (target_partition == OTA_IMG_BOOT_OTA_0) {
    index = 0;
  } else {
    index = 1;
  }
  return index;
}

// Internal structures and fuctions for Parameter Storage ----------------------

static bool FirmwareInfoMaskIsEnabled(EsfParameterStorageManagerMask mask) {
  return ESF_PARAMETER_STORAGE_MANAGER_MASK_IS_ENABLED(FirmwareInfoMask,
                                                       firmware_info, mask);
}

/// @brief Get struct info to access data in the parameter storage
/// @param member_info [in] Used as a member of the struct info
/// @param struct_info [out]
/// @note If either of member_info or struct_info is NULL, does nothing
void FwMgrEsp32FwGetStructInfoForFirmwareInfo(
    EsfParameterStorageManagerMemberInfo *member_info,
    EsfParameterStorageManagerStructInfo *struct_info) {
  if (member_info == NULL || struct_info == NULL) {
    FW_MGR_PL_DLOG_WARNING(
        "member_info or struct_info is NULL. Skip the process.\n");
    return;
  }

  member_info->id = kEsfParameterStorageManagerItemFwMgrBinaryInfoMcuFirmware;
  member_info->type = kEsfParameterStorageManagerItemTypeRaw;
  member_info->offset = offsetof(FirmwareInfo, data);
  member_info->size = ESF_PARAMETER_STORAGE_MANAGER_RAW_SIZEOF(FirmwareInfoData,
                                                               info);
  member_info->enabled = FirmwareInfoMaskIsEnabled;
  member_info->custom = NULL;
  struct_info->items_num = 1;
  struct_info->items = member_info;
}

/// @brief Save hash and date in the Parameter Storage
/// @param target_partition [in]
/// @param hash [in] The buffer size should be FW_MGR_PL_HASH_SIZE.
/// @param update_date [in] If NULL, use the current date. If not NULL, The
/// buffer size should be FW_MGR_PL_UPDATE_DATE_SIZE
/// @return
PlErrCode FwMgrEsp32FwSaveHashAndDate(FwMgrPlOtaImgBootseq target_partition,
                                      const uint8_t *hash,
                                      const char *update_date) {
  FirmwareInfo firmware_info = {0};
  HashDate *hash_date;
  hash_date =
      &firmware_info.data.info[PartitionToHashDateIndex(target_partition)];

  EsfParameterStorageManagerMemberInfo member_info = {0};
  EsfParameterStorageManagerStructInfo struct_info = {0};
  FwMgrEsp32FwGetStructInfoForFirmwareInfo(&member_info, &struct_info);

  FirmwareInfoMask mask = {.firmware_info = 1};

  EsfParameterStorageManagerHandle handle;
  EsfParameterStorageManagerStatus pstorage_ret =
      EsfParameterStorageManagerOpen(&handle);
  if (pstorage_ret != kEsfParameterStorageManagerStatusOk) {
    FW_MGR_PL_DLOG_CRITICAL(
        "EsfParameterStorageManagerOpen func failed. ret = %u\n", pstorage_ret);
    FW_MGR_PL_ELOG_CRITICAL(kFwMgrPlElogCriticalId0x82Fw);
    return kPlErrInternal;
  }

  PlErrCode ret = kPlErrInternal;

  pstorage_ret = EsfParameterStorageManagerLoad(
      handle, (EsfParameterStorageManagerMask)&mask,
      (EsfParameterStorageManagerData)&firmware_info, &struct_info, NULL);
  if (pstorage_ret != kEsfParameterStorageManagerStatusOk) {
    FW_MGR_PL_DLOG_CRITICAL(
        "EsfParameterStorageManagerLoad func failed. ret = %u\n", pstorage_ret);
    FW_MGR_PL_ELOG_CRITICAL(kFwMgrPlElogCriticalId0x83Fw);
    ret = kPlErrInternal;
    goto close_pstorage_then_exit;
  }

  if (ESF_PARAMETER_STORAGE_MANAGER_RAW_IS_EMPTY(&firmware_info.data)) {
    HashDate *info;
    for (uint32_t i = 0; i < kEsp32FlashNumOtaPartitions; ++i) {
      info = &firmware_info.data.info[i];
      memset(info->hash, 0, sizeof(info->hash));
      strncpy(info->update_date, "", sizeof(info->update_date));
    }
  }

  memcpy(hash_date->hash, hash, sizeof(hash_date->hash));
  if (update_date) {
    strncpy(hash_date->update_date, update_date,
            sizeof(hash_date->update_date));
  } else {
    GetCurrentTime(sizeof(hash_date->update_date), hash_date->update_date);
  }

  pstorage_ret = EsfParameterStorageManagerSave(
      handle, (EsfParameterStorageManagerMask)&mask,
      (EsfParameterStorageManagerData)&firmware_info, &struct_info, NULL);
  if (pstorage_ret != kEsfParameterStorageManagerStatusOk) {
    FW_MGR_PL_DLOG_CRITICAL(
        "EsfParameterStorageManagerSave func failed. ret = %u\n", pstorage_ret);
    FW_MGR_PL_ELOG_CRITICAL(kFwMgrPlElogCriticalId0x84Fw);
    ret = kPlErrInternal;
    goto close_pstorage_then_exit;
  }

  ret = kPlErrCodeOk;

close_pstorage_then_exit:
  pstorage_ret = EsfParameterStorageManagerClose(handle);
  if (pstorage_ret != kEsfParameterStorageManagerStatusOk) {
    FW_MGR_PL_DLOG_CRITICAL(
        "EsfParameterStorageManagerClose func failed. ret = %u\n",
        pstorage_ret);
    FW_MGR_PL_ELOG_CRITICAL(kFwMgrPlElogCriticalId0x85Fw);
    ret = kPlErrInternal;
  }

  return ret;
}

// Functions shared to public via FwMgrEsp32FwGetOps()

static PlErrCode FwMgrEsp32FwFinalize(void);
static PlErrCode FwMgrEsp32FwOpen(uint32_t total_write_size,
                                  const uint8_t *hash,
                                  FwMgrEsp32ImplHandle *handle,
                                  uint32_t *max_write_size);
static PlErrCode FwMgrEsp32FwClose(FwMgrEsp32ImplHandle handle, bool aborted,
                                   bool switch_partition, bool *updated);
static PlErrCode FwMgrEsp32FwWrite(FwMgrEsp32ImplHandle handle, uint32_t offset,
                                   EsfMemoryManagerHandle buffer_handle,
                                   uint32_t buffer_offset, uint32_t write_size,
                                   uint32_t *written_size);
static PlErrCode FwMgrEsp32FwAbort(FwMgrEsp32ImplHandle handle);

/// @brief Do the finalization process of this block.
///        - Free the context if it has not been freed.
/// @return always returns kOk
static PlErrCode FwMgrEsp32FwFinalize(void) {
  FW_MGR_PL_DLOG_DEBUG("Start.\n");

  if (s_active_context != NULL) {
    PlErrCode ret = FwMgrEsp32FwClose((FwMgrEsp32ImplHandle)s_active_context,
                                      true, true, NULL);
    if (ret != kPlErrCodeOk) {
      FW_MGR_PL_DLOG_ERROR("FwMgrEsp32FwClose() failed. ret = %u\n", ret);
      FW_MGR_PL_ELOG_ERROR(kFwMgrPlElogErrorId0x70Fw);
      return ret;
    }
  }

