aitrios/aitrios-edge-device-manager/src/porting_layer/src/common/firmware_manager/firmware_manager_esp32_fw.c
  return kPlErrCodeOk;
}

/// @brief (1) Create the context and hand it as a handle to the caller.
///        (2) Check which partition (ota_0 or ota_1) is currently running
///        firmware stored, register the other partition as the "target
///        partition". (A new firmware will be written to the target partition
///        when the `FwMgrEsp32FwWrite` is called after this function is
///        called.)
///        (3) Delete the data written in the target_partition.
/// @param total_write_size [in] Must be a multiple of 32. (ESP32 flash
///        encryption is performed for each of 16-byte block. So the size of an
///        encrypted firmware is a multiple of 16. FwMgrEsp32FwWrite() will
///        receive a binary which includes a firmware encrypted for ota_0 and
///        one for ota_1. So the total size must be a multiple of 32.)
/// @param hash [in] Must be a 32-byte array.
/// @param handle [out]
/// @param max_write_size [out]
/// @return kOk: success, otherwise: failed.
static PlErrCode FwMgrEsp32FwOpen(uint32_t total_write_size,
                                  const uint8_t *hash,
                                  FwMgrEsp32ImplHandle *handle,
                                  uint32_t *max_write_size) {
  FW_MGR_PL_DLOG_DEBUG("Start.\n");

  if (handle == NULL) {
    FW_MGR_PL_DLOG_ERROR("`handle` is NULL.\n");
    FW_MGR_PL_ELOG_ERROR(kFwMgrPlElogErrorId0x71Fw);
    return kPlErrInvalidParam;  // Invalid Argument
  }

  if (max_write_size == NULL) {
    FW_MGR_PL_DLOG_ERROR("`max_write_size` is NULL\n");
    FW_MGR_PL_ELOG_ERROR(kFwMgrPlElogErrorId0x72Fw);
    return kPlErrInvalidParam;
  }

  FwMgrPlOtaImgBootseq target_partition;
  PlErrCode ret = GetTargetPartition(&target_partition);
  if (ret != kPlErrCodeOk) {
    FW_MGR_PL_DLOG_ERROR("GetTargetPartition() failed. ret = %u\n", ret);
    FW_MGR_PL_ELOG_ERROR(kFwMgrPlElogErrorId0x73Fw);
    return ret;
  }

  ret = VerifyTotalWriteSize(target_partition, total_write_size);
  if (ret != kPlErrCodeOk) {
    FW_MGR_PL_DLOG_ERROR("VerifyTotalWriteSize() failed. ret = %u\n", ret);
    FW_MGR_PL_ELOG_ERROR(kFwMgrPlElogErrorId0x74Fw);
    return ret;
  }

  FwMgrEsp32FwContext *context;
  ret = AllocateAndInitializeContext(target_partition, total_write_size,
                                     &context);
  if (ret != kPlErrCodeOk) {
    FW_MGR_PL_DLOG_ERROR("AllocateAndInitializeContext() failed. ret = %u\n",
                         ret);
    FW_MGR_PL_ELOG_ERROR(kFwMgrPlElogErrorId0x75Fw);
    return ret;
  }

  // Set flag of the target partition as invalid.
  ret = Esp32FlashOpInvalidatePartition(target_partition);
  if (ret != kPlErrCodeOk) {
    FW_MGR_PL_DLOG_ERROR(
        "Failed to set the flag of the target partition(%u) as invalid. ret = "
        "%u\n",
        target_partition, ret);
    FW_MGR_PL_ELOG_ERROR(kFwMgrPlElogErrorId0x76Fw);
    goto err_exit;
  }

  // Erase data of the target partition.
  ret = Esp32FlashOpErasePartitionData(target_partition);
  if (ret != kPlErrCodeOk) {
    FW_MGR_PL_DLOG_ERROR(
        "Esp32FlashOpErasePartitionData(%u) failed. ret = %u\n",
        target_partition, ret);
    FW_MGR_PL_ELOG_ERROR(kFwMgrPlElogErrorId0x77Fw);
    goto err_exit;
  }

  // Save hash and date in the parameter storage
  ret = FwMgrEsp32FwSaveHashAndDate(target_partition, hash, NULL);
  if (ret != kPlErrCodeOk) {
    FW_MGR_PL_DLOG_ERROR("FwMgrEsp32FwSaveHashAndDate failed. ret = %u\n", ret);
    FW_MGR_PL_ELOG_ERROR(kFwMgrPlElogErrorId0x78Fw);
    goto err_exit;
  }

  // Open the ota partition
  ret = Esp32FlashOpOpenPartition(target_partition, &context->flash_handle);
  if (ret != kPlErrCodeOk) {
    FW_MGR_PL_DLOG_ERROR("Esp32FlashOpOpenPartition(%u) failed. ret = %u\n",
                         target_partition, ret);
    FW_MGR_PL_ELOG_ERROR(kFwMgrPlElogErrorId0x79Fw);
    goto err_exit;
  }

  *max_write_size = context->max_write_size;
  *handle = (FwMgrEsp32ImplHandle)context;

  return kPlErrCodeOk;

err_exit:
  FreeContext(context);
  return ret;
}

/// @brief (1) [if not aborted] Verify the firmware written in the "target
///        partition".
///        (2) [If not aborted] Set "valid flag" of the target partition.
///        (3) Free the context.
/// @param handle [in]
/// @param aborted [in]
/// @param switch_partition [in]
/// @param updated [out] can be NULL
/// @return kOk: success, otherwise: failed
static PlErrCode FwMgrEsp32FwClose(FwMgrEsp32ImplHandle handle, bool aborted,
                                   bool switch_partition, bool *updated) {
  FW_MGR_PL_DLOG_DEBUG("Start.\n");

  if (updated) *updated = false;

  if (!FW_MGR_PL_VERIFY_HANDLE(handle)) {
    FW_MGR_PL_DLOG_ERROR("`handle` is invalid.\n");
    FW_MGR_PL_ELOG_ERROR(kFwMgrPlElogErrorId0x7aFw);
    return kPlErrInvalidParam;
  }

  FwMgrEsp32FwContext *context = (FwMgrEsp32FwContext *)handle;

  PlErrCode ret;

  // Close the ota partition
  if (context->flash_handle != NULL) {
    ret = Esp32FlashOpClosePartition(context->flash_handle);
    if (ret != kPlErrCodeOk) {
      FW_MGR_PL_DLOG_ERROR("Esp32FlashOpClosePartition() failed. ret = %u\n",
                           ret);
      FW_MGR_PL_ELOG_ERROR(kFwMgrPlElogErrorId0x7bFw);
      return ret;
    }
    context->flash_handle = NULL;
  }

  if (!aborted) {
    FwMgrPlOtaImgBootseq target_partition;
    ret = GetTargetPartition(&target_partition);
    if (ret != kPlErrCodeOk) {
      FW_MGR_PL_DLOG_ERROR("GetTargetPartition() failed. ret = %u\n", ret);
      FW_MGR_PL_ELOG_ERROR(kFwMgrPlElogErrorId0x7cFw);
      return ret;
    }

    Esp32FirmwareInfo firmware_info = {.hash_appended = false,
                                       .firmware_size = 0};
    ret = ReadAndVerifyFirmwareHeader(target_partition, &firmware_info);
    if (ret != kPlErrCodeOk) {
      FW_MGR_PL_DLOG_ERROR("ReadAndVerifyFirmwareHeader(%u) failed. ret = %u\n",
                           target_partition, ret);
      FW_MGR_PL_ELOG_ERROR(kFwMgrPlElogErrorId0x7dFw);
      return ret;
    }

    FW_MGR_PL_DLOG_INFO("Firmware size = 0x%x.\n", firmware_info.firmware_size);

    if (firmware_info.hash_appended) {
      ret = VerifyFirmwareHash(context, target_partition,
                               firmware_info.firmware_size);
      if (ret != kPlErrCodeOk) {
        FW_MGR_PL_DLOG_ERROR("VerifyFirmwareHash(%u) failed. ret = %u\n",
                             target_partition, ret);
        FW_MGR_PL_ELOG_ERROR(kFwMgrPlElogErrorId0x7eFw);
        return ret;
      }
    }

    if (switch_partition) {
      ret = Esp32FlashOpSetNextBootPartition(target_partition);
      if (ret != kPlErrCodeOk) {
        FW_MGR_PL_DLOG_ERROR(
            "Esp32FlashOpSetNextBootPartition(%u) failed. ret = %u\n",
            target_partition, ret);
        FW_MGR_PL_ELOG_ERROR(kFwMgrPlElogErrorId0x7fFw);
        return ret;
      }
    } else {
      FW_MGR_PL_DLOG_INFO("Skip switching partition\n");
      FW_MGR_PL_ELOG_INFO(kFwMgrPlElogInfoId0x60FwSkipSwitchPartition);
    }

    if (updated) *updated = true;
  }

  FreeContext(context);

