aitrios/aitrios-edge-device-manager/src/porting_layer/src/common/firmware_manager/firmware_manager_esp32_fw.c
  return kPlErrCodeOk;
}

/// @brief Receive a binary ([A] and [B] combined), write either [A] or [B] to
/// the flash memory and discard the other.
/// - [A]: the firmware encrypted for ota_0 and
/// - [B]: the same firmware as [A] but encrypted for ota_1.
/// @param handle [in]
/// @param offset [in]
/// @param buffer_handle [in] The buffer where (a part of) the binary is stored.
/// @param buffer_offset [in] The buffer where (a part of) the binary is stored.
/// @param write_size [in] The size of data in the buffer.
/// @param written_size [out] The size of the written data + the size of the
/// discarded data. (The discard data is included because it is a part of
/// "properly processed" data.)
/// @return kOK: success, otherwise: failed
static PlErrCode FwMgrEsp32FwWrite(FwMgrEsp32ImplHandle handle, uint32_t offset,
                                   EsfMemoryManagerHandle buffer_handle,
                                   uint32_t buffer_offset, uint32_t write_size,
                                   uint32_t *written_size) {
  FW_MGR_PL_DLOG_DEBUG("Start.\n");

  if (!FW_MGR_PL_VERIFY_HANDLE(handle)) {
    FW_MGR_PL_DLOG_ERROR("`handle` is invalid.\n");
    FW_MGR_PL_ELOG_ERROR(kFwMgrPlElogErrorId0x80Fw);
    return kPlErrInvalidParam;
  }

  if (written_size == NULL) {
    FW_MGR_PL_DLOG_ERROR("`written_size` is NULL.\n");
    FW_MGR_PL_ELOG_ERROR(kFwMgrPlElogErrorId0x81Fw);
    return kPlErrInvalidParam;
  }

  FwMgrEsp32FwContext *context = (FwMgrEsp32FwContext *)handle;

  if ((write_size == 0) || (write_size > context->max_write_size)) {
    FW_MGR_PL_DLOG_CRITICAL(
        "`write_size` must be in the range of (0, 0x%x], but it is 0x%x.\n",
        context->max_write_size, write_size);
    FW_MGR_PL_ELOG_CRITICAL(kFwMgrPlElogCriticalId0x64InvalidSize);
    return kPlErrInvalidParam;
  }

  *written_size = 0;

  // The size of data to be discarded ahead of the data to be written.
  // Can be non-zero only when target partition is ota_1.
  uint32_t discarded_size_0 = 0;
  // The size of data to be discarded behind the data to be written.
  // Can be non-zero only when target partition is ota_0.
  uint32_t discarded_size_1 = 0;

  // With below calculation, discarded_data_size_# can be larger than
  // write_size. But, it is no problem, because writing to the flash memory will
  // be skipped in that case.
  if (offset < context->starting_offset)
    discarded_size_0 = context->starting_offset - offset;

  if (context->ending_offset < offset + write_size)
    discarded_size_1 = offset + write_size - context->ending_offset;

  if (write_size <= discarded_size_0 + discarded_size_1) {
    *written_size = write_size;
    return kPlErrCodeOk;
  }

  FW_MGR_PL_DLOG_DEBUG("offset = 0x%x\n", offset);

  write_size -= discarded_size_0 + discarded_size_1;
  buffer_offset += discarded_size_0;
  FW_MGR_PL_DLOG_DEBUG(
      "write_size = 0x%x, offset = 0x%x, starting_offset = 0x%x, "
      "ending_offset = 0x%x\n",
      write_size, offset, context->starting_offset, context->ending_offset);

  uint32_t actual_written_size;
  PlErrCode ret = FwMgrEsp32FwImplWrite(context, write_size, buffer_handle,
                                        buffer_offset, &actual_written_size);
  if (ret != kPlErrCodeOk) {
    FW_MGR_PL_DLOG_ERROR("FwMgrEsp32FwImplWrite() failed.\n");
    FW_MGR_PL_ELOG_ERROR(kFwMgrPlElogErrorId0x82Fw);
    return ret;
  }

  *written_size = discarded_size_0 + actual_written_size;
  if (actual_written_size == write_size) *written_size += discarded_size_1;

  return kPlErrCodeOk;
}

/// @brief Do nothing
/// @param handle
/// @return
static PlErrCode FwMgrEsp32FwAbort(FwMgrEsp32ImplHandle handle) {
  FW_MGR_PL_DLOG_DEBUG("Start.\n");

  if (!FW_MGR_PL_VERIFY_HANDLE(handle)) {
    FW_MGR_PL_DLOG_ERROR("`handle` is invalid.\n");
    FW_MGR_PL_ELOG_ERROR(kFwMgrPlElogErrorId0x83Fw);
    return kPlErrInvalidParam;
  }

  return kPlErrCodeOk;
}

// Public Functions ---------------------------------------------------------

PlErrCode FwMgrEsp32FwGetOps(FwMgrEsp32ImplOps *ops) {
  FW_MGR_PL_DLOG_DEBUG("Start.\n");

  if (ops == NULL) {
    FW_MGR_PL_DLOG_ERROR("`ops` is NULL.\n");
    FW_MGR_PL_ELOG_ERROR(kFwMgrPlElogErrorId0x84Fw);
    return kPlErrInvalidParam;
  }

  ops->finalize = FwMgrEsp32FwFinalize;
  ops->open = FwMgrEsp32FwOpen;
  ops->close = FwMgrEsp32FwClose;
  ops->write = FwMgrEsp32FwWrite;
  ops->abort = FwMgrEsp32FwAbort;

  return kPlErrCodeOk;
}

PlErrCode FwMgrEsp32FwGetHashAndUpdateDate(int32_t hash_size, uint8_t *hash,
                                           int32_t update_date_size,
                                           char *update_date) {
  if (hash == NULL || update_date == NULL) {
    FW_MGR_PL_DLOG_ERROR("hash (%p) or update_date (%p) is NULL.\n", hash,
                         update_date);
    FW_MGR_PL_ELOG_ERROR(kFwMgrPlElogErrorId0x85Fw);
    return kPlErrInvalidParam;
  }

  if (hash_size > FW_MGR_PL_HASH_SIZE) hash_size = FW_MGR_PL_HASH_SIZE;
  if (update_date_size > FW_MGR_PL_UPDATE_DATE_SIZE)
    update_date_size = FW_MGR_PL_UPDATE_DATE_SIZE;

  FwMgrPlOtaImgBootseq active_partition;
  PlErrCode ret = Esp32FlashOpGetActivePartition(&active_partition);
  if (ret != kPlErrCodeOk) {
    FW_MGR_PL_DLOG_ERROR("Esp32FlashOpGetActivePartition failed.\n ret = %u.\n",
                         ret);
    FW_MGR_PL_ELOG_ERROR(kFwMgrPlElogErrorId0x86Fw);
    return ret;
  }

  FirmwareInfo firmware_info = {0};
  HashDate *hash_date;
  hash_date =
      &firmware_info.data.info[PartitionToHashDateIndex(active_partition)];

  EsfParameterStorageManagerMemberInfo member_info = {0};
  EsfParameterStorageManagerStructInfo struct_info = {0};
  FwMgrEsp32FwGetStructInfoForFirmwareInfo(&member_info, &struct_info);

  FirmwareInfoMask mask = {.firmware_info = 1};

  EsfParameterStorageManagerHandle handle;
  EsfParameterStorageManagerStatus pstorage_ret =
      EsfParameterStorageManagerOpen(&handle);
  if (pstorage_ret != kEsfParameterStorageManagerStatusOk) {
    FW_MGR_PL_DLOG_CRITICAL(
        "EsfParameterStorageManagerOpen func failed. ret = %u\n", pstorage_ret);
    FW_MGR_PL_ELOG_CRITICAL(kFwMgrPlElogCriticalId0x86Fw);
    return kPlErrInternal;
  }

  pstorage_ret = EsfParameterStorageManagerLoad(
      handle, (EsfParameterStorageManagerMask)&mask,
      (EsfParameterStorageManagerData)&firmware_info, &struct_info, NULL);
  if (pstorage_ret != kEsfParameterStorageManagerStatusOk) {
    FW_MGR_PL_DLOG_CRITICAL(
        "EsfParameterStorageManagerLoad func failed. ret = %u\n", pstorage_ret);
    FW_MGR_PL_ELOG_CRITICAL(kFwMgrPlElogCriticalId0x87Fw);
    ret = kPlErrInternal;
    goto close_pstorage_then_exit;
  }

  if (ESF_PARAMETER_STORAGE_MANAGER_RAW_IS_EMPTY(&firmware_info.data)) {
    memset(hash_date->hash, 0, sizeof(hash_date->hash));
    strncpy(hash_date->update_date, "", sizeof(hash_date->update_date));
  }

  if (hash_size > 0) memcpy(hash, hash_date->hash, hash_size);
  if (update_date_size > 0) {
    strncpy(update_date, hash_date->update_date, update_date_size);
    update_date[update_date_size - 1] = '\0';
  }

  ret = kPlErrCodeOk;

close_pstorage_then_exit:
  pstorage_ret = EsfParameterStorageManagerClose(handle);
  if (pstorage_ret != kEsfParameterStorageManagerStatusOk) {
    FW_MGR_PL_DLOG_CRITICAL(
        "EsfParameterStorageManagerClose func failed. ret = %u\n",
        pstorage_ret);
    FW_MGR_PL_ELOG_CRITICAL(kFwMgrPlElogCriticalId0x88Fw);
    ret = kPlErrInternal;
  }

  return ret;
}

// Return nothing because failure of the migration should not stop the operation
// of the FW manager.
void FwMgrEsp32FwMigrateFromV1(void) {
  // Migration from v1 is only for T3P
#ifdef CONFIG_EXTERNAL_TARGET_T3P
  PlErrCode ret = FwMgrEsp32FwImplMigrateUpdateDateFromV1();
  if (ret != kPlErrCodeOk) {
    FW_MGR_PL_DLOG_ERROR(
        "FwMgrEsp32FwImplMigrateUpdateDateFromV1 failed. ret = %u\n", ret);
    FW_MGR_PL_ELOG_ERROR(kFwMgrPlElogErrorId0x88Fw);
  }
#endif
}
